THREAD_KEYWORDS = {
    57: [
        "Менеджер по маркетингу",
        "Специалист по цифровому маркетингу",
        "Торговый представитель",
        "Менеджер по продажам B2B",
        "Аналитик маркетинговых исследований",
        "Руководитель отдела маркетинга",
        "Специалист по таргетированной рекламе",
        "Менеджер по работе с клиентами",
        "Координатор рекламных кампаний",
        "Менеджер по аналитике продаж",
        "Креативный директор",
        "PR-менеджер",
        "Менеджер по развитию бренда",
        "Специалист по SEO",
        "Аналитик рынка",
        "Менеджер по медиапланированию",
        "Копирайтер",
        "Аккаунт-менеджер",
        "Специалист по аналитике данных в маркетинге",
        "Директор по маркетингу",
        'Целевая аудитория',
        'Продвижение продукта',
        'Рекламная кампания',
        'Таргетированная реклама',
        'CRM система',
        'Продажи по телефону',
        'Маркетинговые исследования',
        'Продажи B2B/B2C',
        'Увеличение конверсии',
        'Аналитика продаж'
    ],
    56: [
        "Системный администратор",
        "Программист-аналитик",
        "Инженер технической поддержки",
        "Администратор баз данных",
        "Специалист по обработке данных",
        "Web-разработчик",
        "Тестировщик программного обеспечения",
        "Администратор серверов",
        "DevOps-инженер",
        "Архитектор информационных систем",
        "Инженер по кибербезопасности",
        "Специалист по искусственному интеллекту",
        "Аналитик больших данных",
        "Сетевой инженер",
        "UX/UI дизайнер",
        "Технический писатель",
        "Специалист по машинному обучению",
        "Криптограф",
        "Администратор облачных сервисов",
        "Инженер по автоматизации тестирования",
        'Программирование',
        'Разработка ПО',
        'Веб-разработка',
        'Базы данных',
        'Тестирование ПО',
        'Анализ данных',
        'Архитектура ПО',
        'Мобильные приложения',
        'Искусственный интеллект',
        'Облачные технологии',
        'Data Scientist',
        'Machine Learning Engineer',
        'AI'
    ],
    107: [
        "Юрист по налоговому праву",
        "Финансовый аналитик",
        "Адвокат по корпоративным договорам",
        "Бухгалтер-аудитор",
        "Специалист по инвестициям",
        "Финансовый консультант",
        "Арбитражный юрист",
        "Бухгалтер по учёту",
        "Юрист по недвижимости",
        "Финансовый планировщик",
        "Кредитный аналитик",
        "Аудитор",
        "Финансовый контролер",
        "Налоговый консультант",
        "Финансовый аналитик инвестиций",
        "Казначей",
        "Финансовый аналитик по риску",
        "Специалист по внутреннему аудиту",
        "Финансовый менеджер",
        "Лизинговый менеджер",
        'Налоговое право',
        'Корпоративные договоры',
        'Финансовый анализ',
        'Арбитраж',
        'Бухгалтерская отчётность',
        'Недвижимость и земельное право',
        'Инвестиции',
        'Финансовое планирование',
        'Юридическое консультирование',
        'Аудит финансовой деятельности'
    ],
    10: [
        "HR-менеджер",
        "Специалист по управлению проектами",
        "Офис-менеджер",
        "Кадровик",
        "Специалист по оценке персонала",
        "Администратор офиса",
        "Менеджер по подбору персонала",
        "Секретарь-референт",
        "Директор по административной работе",
        "Координатор по управлению документооборотом",
        "Специалист по организации мероприятий",
        "HR-аналитик",
        "Координатор по обучению персонала",
        "Менеджер по адаптации сотрудников",
        "Специалист по внутренним коммуникациям",
        "HR-консультант",
        "Офис-координатор",
        "Специалист по кадровому делопроизводству",
        "Директор по развитию персонала",
        "Менеджер по корпоративной культуре",
        'Управление проектами',
        'Организация рабочего процесса',
        'Подбор персонала',
        'Оценка эффективности',
        'Трудовое законодательство',
        'Деловая переписка',
        'Управление документооборотом',
        'Планирование бюджета',
        'Административная поддержка',
        'Управление офисом'
    ],
    7: [
        "Логист",
        "Продавец",
        "Специалист по снабжению",
        "Менеджер по логистике",
        "Торговый представитель розничной сети",
        "Специалист по инвентаризации",
        "Директор по логистике и поставкам",
        "Менеджер по качеству",
        "Аналитик по контролю запасов",
        "Руководитель склада",
        "Мерчендайзер",
        "Директор по закупкам",
        "Специалист по таможенному оформлению",
        "Оператор call-центра логистической компании",
        "Специалист по транспортной логистике",
        "Комплектовщик",
        "Координатор по доставке",
        "Менеджер по логистике в электронной коммерции",
        "Специалист по упаковке и маркировке товаров",
        "Аналитик по логистике",
        "Специалист по складскому учёту",
        'Снабжение',
        'Инвентаризация',
        'Оптимизация логистики',
        'Управление запасами',
        'Транспортировка грузов',
        'Контроль качества',
        'Розничные продажи',
        'Мерчендайзинг',
        'Управление складом',
        'Поставщики и поставки'
    ]
}

START_MESSAGE = ('''
*Добро пожаловать в Job Board Bot\!*
Я помогу вам опубликовать вакансии в группе *Job Board:Доска Вакансий*\.

Нажмите кнопку '📑 Пример вакансии' чтобы ознакомиться с примером вакансии\.

Вы также можете ознакомиться с правилами публикации, нажав на кнопку '📔 Правила публикации'\.

Чтобы опубликовать свою *вакансию*, нажмите кнопку '✅Опубликовать вакансию' и выберете срок публикации\.

Следуйте инструкциям и заполните необходимую информацию\. После публикации, вы получите ссылку на вашу вакансию\.


Бот находится в тестовом режиме, если будут проблемы \- пишите @baby\_shit
''')


RULES_TEXT = ('''
    \u200B*ПРАВИЛА ПУБЛИКАЦИИ ВАКАНСИЙ*:\

    \u2022 Вакансии размещаются *БЕСПЛАТНО*\.

    \u2022 Повторная публикация возможна через 30 минут\.

    \u2022 Резюме и бартерные вакансии *НЕ* размещаем\.

    \u2022 При большом отклике по вашей просьбе вакансию удаляем\. 

    \u2022 Принимаются к размещению только *КОРРЕКТНО ЗАПОЛНЕННЫЕ* заявки\.

❗️Просим *не добавлять* свои эмодзи/другую информацию, не убирать блоки, и не применять выделения/подчеркивания\.

\(Иначе ваша вакансия не опубликуется\)

\#Блок \#Из \#Минимум \#Пяти \#Хэштегов

*Название организации\:*
Организация \| Город

*Должность\:*
\- … 
\- …
\- …

*Требования к кандидату\:*
\- … 
\- …
\- …

*Условия работы\:*
\- … 
\- …
\- …

*ЗП/Оклад\:*
\- … 
\- …
\- …    

*Контактные данные*\:
 \(ссылка на Telegram/номер телефона/почта/ссылка на Google Форму\)

Копируйте и заполняйте\.
''')

EXAMPLE = ('''
*Пример правильно заполненной вакансии:*\:


\#AIInnovations \#Python \#TensorFlow \#DataScientist \#MachineLearning

*Название организации*\:
AI Innovations \| Москва

*Должность*\:
\- Data Scientist
\- Machine Learning Engineer
\- AI Researcher

*Требования к кандидату*\:
\- Опыт работы с Python и TensorFlow
\- Знание алгоритмов машинного обучения
\- Высшее техническое образование

*Условия работы*\:
\- Гибкий график
\- Интересные проекты
\- Возможность карьерного роста

*ЗП/Оклад\:*
\- От 150 000 рублей до 300 000 рублей в месяц

*Контактные данные*\:
Telegram: @MyTelegram
Телефон: \+7\(999\)123\-45\-67
Email:hr@ai\-innovations\.com
''')
